
## Plan Result (v3-proxy-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/42876)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 9 to change, 22 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.aws-otel-collector-log-group
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
* Delete
  * aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsapp_1BD9B7CA
  * aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsxraydaemon_190D5E0A
  * aws_codepipeline.v3proxyapi_codepipeline_codepipeline_128FF3C7
  * aws_iam_role.v3proxyapi_application_autoscaling_autoscalingrole_29A8A2D5
  * aws_iam_role.v3proxyapi_codepipeline_codepipelinerole_4D7127CE
  * aws_iam_role_policy.v3proxyapi_application_autoscaling_autoscalingrolepolicy_BF5CE59E
  * aws_iam_role_policy.v3proxyapi_codepipeline_codepipelinerolepolicy_C70ECD99
  * aws_s3_bucket.v3proxyapi_codepipeline_codepipelinebucket_0C196E90
  * aws_sns_topic.v3proxyapi_pagerduty_alarmcriticaltopic_535F94D5
  * aws_sns_topic.v3proxyapi_pagerduty_alarmnoncriticaltopic_4C11AAAF
  * aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmcriticalsubscription_678DCB7E
  * aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmnoncriticalsubscription_DFB3A2BA
  * null_resource.v3proxyapi_application_ecsservice_60C9E8B5
  * null_resource.v3proxyapi_application_ecsservice_createtaskdefinitionfile_AA5C30F4
  * pagerduty_service.v3proxyapi_pagerduty_pagerdutycritical_4B63F007
  * pagerduty_service.v3proxyapi_pagerduty_pagerdutynoncritical_9355E0E2
  * pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181critical_F7F4BF9E
  * pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181noncritical_2EA18A56
  * pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dcritical_EBABC12B
  * pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dnoncritical_D78AAE24
* Replace
  * aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
* Move
  * aws_acm_certificate.v3proxyapi_application_albcertificate_2909DA36 => aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.v3proxyapi_application_albcertificate_certificatevalidation_D3730114 => aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.v3proxyapi_application_applicationloadbalancer_alb_AC937968 => aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.v3proxyapi_application_listenerhttp_51D13858 => aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.v3proxyapi_application_listenerhttps_E66C6C46 => aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.v3proxyapi_application_ecsservice_listenerrule_531F1B48 => aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.v3proxyapi_application_ecsservice_bluetargetgroup_ecstargetgroup_E154D152 => aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.v3proxyapi_application_ecsservice_greentargetgroup_ecstargetgroup_BDD4550E => aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.v3proxyapi_application_autoscaling_scaleinpolicy_855C64E0 => aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.v3proxyapi_application_autoscaling_scaleoutpolicy_56ACDFB0 => aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.v3proxyapi_application_autoscaling_autoscalingtarget_3EEB7147 => aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.v3proxyapi_application_cloudwatchdashboard_EFDC2073 => aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_metric_alarm.v3proxyapi_application_alarmhttptarget5xxerrorrate_EEAF38D5 => aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_cloudwatch_metric_alarm.v3proxyapi_application_autoscaling_scaleinalarm_DB577F18 => aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.v3proxyapi_application_autoscaling_scaleoutalarm_575510E9 => aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_codedeploy_app.v3proxyapi_application_ecsservice_ecscodedeploy_ecscodedeploy_AB98C680 => aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.v3proxyapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_F7C68225 => aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.v3proxyapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_C5AC9DF2 => aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_ecr_lifecycle_policy.v3proxyapi_application_ecsservice_ecrapp_ecrrepolifecyclepolicy_0738A0D1 => aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.v3proxyapi_application_ecsservice_ecrapp_ecrrepo_A9F21ABC => aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.v3proxyapi_application_ecscluster_42B76AE8 => aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.v3proxyapi_application_ecsservice_ecsservice_127BF37E => aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.v3proxyapi_application_ecsservice_ecstask_C8D68563 => aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.v3proxyapi_application_ecsservice_ecsiam_ecstaskexecutionrolepolicy_FF0524F1 => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.v3proxyapi_application_ecsservice_ecsiam_ecstaskrolepolicy_BFFBC3F6 => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role.v3proxyapi_application_ecsservice_ecsiam_ecsexecutionrole_5FCB9504 => aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.v3proxyapi_application_ecsservice_ecsiam_ecstaskrole_BE6F4D42 => aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.v3proxyapi_application_ecsservice_ecscodedeploy_ecscodedeployrole_73C5AE65 => aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role_policy_attachment.v3proxyapi_application_ecsservice_ecsiam_ecstaskcustomattachment_E682C47C => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.v3proxyapi_application_ecsservice_ecsiam_ecstaskexecutioncustomattachment_EA078D8E => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.v3proxyapi_application_ecsservice_ecsiam_ecstaskexecutiondefaultattachment_58775B21 => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.v3proxyapi_application_ecsservice_ecscodedeploy_ecscodedeployroleattachment_932F245F => aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_route53_record.v3proxyapi_application_albcertificate_certificaterecord_C12A9ACF => aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.v3proxyapi_application_albrecord_0818F912 => aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.v3proxyapi_application_basedns_subhostedzonens_DF20B0BA => aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.v3proxyapi_application_basedns_subhostedzone_5B351F92 => aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_security_group.v3proxyapi_application_applicationloadbalancer_albsecuritygroup_B75126E7 => aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.v3proxyapi_application_ecsservice_ecssecuritygroup_29601FAC => aws_security_group.application_ecs_service_ecs_security_group_231C6B1E


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_acm_certificate.v3proxyapi_application_albcertificate_2909DA36 has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/83154caf-7675-4a7f-86e2-93af356c47dc"
        tags                      = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.v3proxyapi_application_albcertificate_certificatevalidation_D3730114 has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "2023-02-13 23:19:35.967 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.v3proxyapi_application_applicationloadbalancer_alb_AC937968 has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996"
        name                                        = "v3Prxy2023021323181927470000000d"
        tags                                        = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be updated in-place
  # (moved from aws_alb_listener.v3proxyapi_application_listenerhttp_51D13858)
  ~ resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/49e7d22e6f72dcd5"
      ~ tags              = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
      ~ tags_all          = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be updated in-place
  # (moved from aws_alb_listener.v3proxyapi_application_listenerhttps_E66C6C46)
  ~ resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a"
      ~ tags              = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
      ~ tags_all          = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be updated in-place
  # (moved from aws_alb_listener_rule.v3proxyapi_application_ecsservice_listenerrule_531F1B48)
  ~ resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a/81eeeac1dfa69442"
      ~ tags         = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
      ~ tags_all     = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
        # (3 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.v3proxyapi_application_ecsservice_bluetargetgroup_ecstargetgroup_E154D152 has moved to aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
    resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/v3Prxy20230213231817765000000005/415bd752a48fc80b"
        name                               = "v3Prxy20230213231817765000000005"
        tags                               = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
            "type"        = "blue"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.v3proxyapi_application_ecsservice_greentargetgroup_ecstargetgroup_BDD4550E has moved to aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
    resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/v3Prxy20230213231817835400000006/6e670fd0f9d676c3"
        name                               = "v3Prxy20230213231817835400000006"
        tags                               = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
            "type"        = "green"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_appautoscaling_policy.v3proxyapi_application_autoscaling_scaleinpolicy_855C64E0 has moved to aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
        id                 = "V3ProxyApi-Prod-ScaleInPolicy"
        name               = "V3ProxyApi-Prod-ScaleInPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.v3proxyapi_application_autoscaling_scaleoutpolicy_56ACDFB0 has moved to aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
        id                 = "V3ProxyApi-Prod-ScaleOutPolicy"
        name               = "V3ProxyApi-Prod-ScaleOutPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.v3proxyapi_application_autoscaling_autoscalingtarget_3EEB7147 has moved to aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
    resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/V3ProxyApi-Prod/V3ProxyApi-Prod"
        tags               = {}
        # (8 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED must be replaced
  # (moved from aws_cloudwatch_dashboard.v3proxyapi_application_cloudwatchdashboard_EFDC2073)
-/+ resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
      ~ dashboard_arn  = "arn:aws:cloudwatch::996905175585:dashboard/V3ProxyApi-Prod-ALBDashboard" -> (known after apply)
      ~ dashboard_body = jsonencode( # whitespace changes
            {
                widgets = [
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_Target_4XX_Count",
                                    "LoadBalancer",
                                    "app/v3Prxy2023021323181927470000000d/5b3871332038c996",
                                    {
                                        color = "#ff7f0e"
                                        yAxis = "left"
                                    },
                                ],
                                [
                                    ".",
                                    "RequestCount",
                                    ".",
                                    ".",
                                    {
                                        color = "#1f77b4"
                                        yAxis = "right"
                                    },
                                ],
                                [
                                    ".",
                                    "HTTPCode_Target_5XX_Count",
                                    ".",
                                    ".",
                                    {
                                        color = "#d62728"
                                    },
                                ],
                                [
                                    ".",
                                    "HTTPCode_Target_2XX_Count",
                                    ".",
                                    ".",
                                    {
                                        color = "#2ca02c"
                                        yAxis = "right"
                                    },
                                ],
                            ]
                            period  = 60
                            region  = "us-east-1"
                            stacked = false
                            stat    = "Sum"
                            title   = "Target Requests"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 12
                        x          = 0
                        y          = 0
                    },
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_ELB_4XX_Count",
                                    "LoadBalancer",
                                    "app/v3Prxy2023021323181927470000000d/5b3871332038c996",
                                    {
                                        color = "#ff7f0e"
                                        yAxis = "left"
                                    },
                                ],
                                [
                                    ".",
                                    "RequestCount",
                                    ".",
                                    ".",
                                    {
                                        color = "#1f77b4"
                                        yAxis = "right"
                                    },
                                ],
                                [
                                    ".",
                                    "HTTPCode_ELB_5XX_Count",
                                    ".",
                                    ".",
                                    {
                                        color = "#d62728"
                                    },
                                ],
                            ]
                            period  = 60
                            region  = "us-east-1"
                            stacked = false
                            stat    = "Sum"
                            title   = "ALB Requests"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 12
                        x          = 12
                        y          = 0
                    },
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "AWS/ApplicationELB",
                                    "TargetResponseTime",
                                    "LoadBalancer",
                                    "app/v3Prxy2023021323181927470000000d/5b3871332038c996",
                                    {
                                        color = "#aec7e8"
                                        label = "Average"
                                    },
                                ],
                                [
                                    "...",
                                    {
                                        color = "#ffbb78"
                                        label = "p95"
                                        stat  = "p95"
                                    },
                                ],
                                [
                                    "...",
                                    {
                                        color = "#98df8a"
                                        label = "p99"
                                        stat  = "p99"
                                    },
                                ],
                            ]
                            period  = 60
                            region  = "us-east-1"
                            stacked = false
                            stat    = "Average"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 12
                        x          = 12
                        y          = 6
                    },
                    {
                        height     = 6
                        properties = {
                            annotations = {
                                horizontal = [
                                    {
                                        color = "#e377c2"
                                        label = "CPU scale out"
                                        value = 45
                                    },
                                    {
                                        color = "#c5b0d5"
                                        label = "CPU scale in"
                                        value = 30
                                    },
                                ]
                            }
                            metrics     = [
                                [
                                    "ECS/ContainerInsights",
                                    "RunningTaskCount",
                                    "ServiceName",
                                    "V3ProxyApi-Prod",
                                    "ClusterName",
                                    "V3ProxyApi-Prod",
                                    {
                                        color = "#c49c94"
                                        yAxis = "right"
                                    },
                                ],
                                [
                                    "AWS/ECS",
                                    "CPUUtilization",
                                    ".",
                                    ".",
                                    ".",
                                    ".",
                                    {
                                        color = "#f7b6d2"
                                    },
                                ],
                                [
                                    ".",
                                    "MemoryUtilization",
                                    ".",
                                    ".",
                                    ".",
                                    ".",
                                    {
                                        color = "#c7c7c7"
                                    },
                                ],
                            ]
                            period      = 60
                            region      = "us-east-1"
                            stacked     = false
                            stat        = "Average"
                            title       = "Service Load"
                            view        = "timeSeries"
                        }
                        type       = "metric"
                        width      = 12
                        x          = 0
                        y          = 6
                    },
                ]
            }
        )
      ~ dashboard_name = "V3ProxyApi-Prod-ALBDashboard" -> "V3ProxyApi-Prod" # forces replacement
      ~ id             = "V3ProxyApi-Prod-ALBDashboard" -> (known after apply)
    }

  # aws_cloudwatch_log_group.app-log-group will be created
  + resource "aws_cloudwatch_log_group" "app-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/V3ProxyApi-Prod/ecs/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
    }

  # aws_cloudwatch_log_group.aws-otel-collector-log-group will be created
  + resource "aws_cloudwatch_log_group" "aws-otel-collector-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/V3ProxyApi-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "V3ProxyApi"
        }
    }

  # aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsapp_1BD9B7CA will be destroyed
  # (because aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsapp_1BD9B7CA is not in configuration)
  - resource "aws_cloudwatch_log_group" "v3proxyapi_application_ecsservice_ecsapp_1BD9B7CA" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/V3ProxyApi-Prod/app20230213231817077400000001" -> null
      - id                = "/ecs/V3ProxyApi-Prod/app20230213231817077400000001" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/V3ProxyApi-Prod/app20230213231817077400000001" -> null
      - name_prefix       = "/ecs/V3ProxyApi-Prod/app" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "V3ProxyApi"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "V3ProxyApi"
        } -> null
    }

  # aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsxraydaemon_190D5E0A will be destroyed
  # (because aws_cloudwatch_log_group.v3proxyapi_application_ecsservice_ecsxraydaemon_190D5E0A is not in configuration)
  - resource "aws_cloudwatch_log_group" "v3proxyapi_application_ecsservice_ecsxraydaemon_190D5E0A" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/V3ProxyApi-Prod/xray-daemon20230213231817754300000004" -> null
      - id                = "/ecs/V3ProxyApi-Prod/xray-daemon20230213231817754300000004" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/V3ProxyApi-Prod/xray-daemon20230213231817754300000

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

e53_record.v3proxyapi_application_albrecord_0818F912 has moved to aws_route53_record.application_alb_record_8EA9D3F9
    resource "aws_route53_record" "application_alb_record_8EA9D3F9" {
        id                               = "Z05649472FMTVD4ZOESQK_v3-proxy-api.readitlater.com_A_1"
        name                             = "v3-proxy-api.readitlater.com"
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.v3proxyapi_application_basedns_subhostedzonens_DF20B0BA has moved to aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
    resource "aws_route53_record" "application_base_dns_subhosted_zone_ns_DFB88A22" {
        id                               = "Z2BHWTOWFVNW3M_v3-proxy-api.readitlater.com_NS"
        name                             = "v3-proxy-api.readitlater.com"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_zone.v3proxyapi_application_basedns_subhostedzone_5B351F92 has moved to aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
    resource "aws_route53_zone" "application_base_dns_subhosted_zone_77521D1C" {
        id                  = "Z05649472FMTVD4ZOESQK"
        name                = "v3-proxy-api.readitlater.com"
        tags                = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.v3proxyapi_codepipeline_codepipelinebucket_0C196E90 will be destroyed
  # (because aws_s3_bucket.v3proxyapi_codepipeline_codepipelinebucket_0C196E90 is not in configuration)
  - resource "aws_s3_bucket" "v3proxyapi_codepipeline_codepipelinebucket_0C196E90" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::pocket-codepipeline-14bfb553e3ab765d4f00fdfff004b5fb" -> null
      - bucket                      = "pocket-codepipeline-14bfb553e3ab765d4f00fdfff004b5fb" -> null
      - bucket_domain_name          = "pocket-codepipeline-14bfb553e3ab765d4f00fdfff004b5fb.s3.amazonaws.com" -> null
      - bucket_prefix               = "pocket-codepipeline-14bfb5" -> null
      - bucket_regional_domain_name = "pocket-codepipeline-14bfb553e3ab765d4f00fdfff004b5fb.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "pocket-codepipeline-14bfb553e3ab765d4f00fdfff004b5fb" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "92f1efb5501a01f6ebb8e3628131c3483688d3e5ca1a7c175420c565a06a6616" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_security_group.v3proxyapi_application_applicationloadbalancer_albsecuritygroup_B75126E7 has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-0149a253bfa33b594"
        name                   = "V3ProxyApi-Prod-HTTP/S Security Group20230213231817845800000007"
        tags                   = {
            "Name"        = "V3ProxyApi-Prod-HTTP/S Security Group"
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.v3proxyapi_application_ecsservice_ecssecuritygroup_29601FAC has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-014398a6a95e77b46"
        name                   = "V3ProxyApi-Prod-ECSSecurityGroup2023021323181927290000000c"
        tags                   = {
            "environment" = "Prod"
            "service"     = "V3ProxyApi"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.v3proxyapi_pagerduty_alarmcriticaltopic_535F94D5 will be destroyed
  # (because aws_sns_topic.v3proxyapi_pagerduty_alarmcriticaltopic_535F94D5 is not in configuration)
  - resource "aws_sns_topic" "v3proxyapi_pagerduty_alarmcriticaltopic_535F94D5" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "V3ProxyApi-Prod-Infrastructure-Alarm-Critical" -> null
      - owner                                    = "996905175585" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "996905175585"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # aws_sns_topic.v3proxyapi_pagerduty_alarmnoncriticaltopic_4C11AAAF will be destroyed
  # (because aws_sns_topic.v3proxyapi_pagerduty_alarmnoncriticaltopic_4C11AAAF is not in configuration)
  - resource "aws_sns_topic" "v3proxyapi_pagerduty_alarmnoncriticaltopic_4C11AAAF" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical" -> null
      - owner                                    = "996905175585" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "996905175585"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmcriticalsubscription_678DCB7E will be destroyed
  # (because aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmcriticalsubscription_678DCB7E is not in configuration)
  - resource "aws_sns_topic_subscription" "v3proxyapi_pagerduty_alarmcriticalsubscription_678DCB7E" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical:14d9f053-4272-4dfd-9512-ca20827af748" -> null
      - confirmation_timeout_in_minutes = 2 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "https://events.pagerduty.com/integration/2c982c1f578c4a0dc0ae90d7694e6d24/enqueue" -> null
      - endpoint_auto_confirms          = true -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical:14d9f053-4272-4dfd-9512-ca20827af748" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Critical" -> null
    }

  # aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmnoncriticalsubscription_DFB3A2BA will be destroyed
  # (because aws_sns_topic_subscription.v3proxyapi_pagerduty_alarmnoncriticalsubscription_DFB3A2BA is not in configuration)
  - resource "aws_sns_topic_subscription" "v3proxyapi_pagerduty_alarmnoncriticalsubscription_DFB3A2BA" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical:87f15670-2879-4ebe-9896-2acc94ff3c65" -> null
      - confirmation_timeout_in_minutes = 2 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "https://events.pagerduty.com/integration/b49ecaf57bdd4803d0acfa361d6cb7b8/enqueue" -> null
      - endpoint_auto_confirms          = true -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical:87f15670-2879-4ebe-9896-2acc94ff3c65" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "https" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:V3ProxyApi-Prod-Infrastructure-Alarm-Non-Critical" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.v3proxyapi_application_ecsservice_appspec_3CA4101E)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.v3proxyapi_application_ecsservice_60C9E8B5 will be destroyed
  # (because null_resource.v3proxyapi_application_ecsservice_60C9E8B5 is not in configuration)
  - resource "null_resource" "v3proxyapi_application_ecsservice_60C9E8B5" {
      - id = "4358440994314405399" -> null
    }

  # null_resource.v3proxyapi_application_ecsservice_createtaskdefinitionfile_AA5C30F4 will be destroyed
  # (because null_resource.v3proxyapi_application_ecsservice_createtaskdefinitionfile_AA5C30F4 is not in configuration)
  - resource "null_resource" "v3proxyapi_application_ecsservice_createtaskdefinitionfile_AA5C30F4" {
      - id       = "6511889150480078608" -> null
      - triggers = {
          - "alwaysRun" = "2023-08-11T19:01:17Z"
        } -> null
    }

  # pagerduty_service.v3proxyapi_pagerduty_pagerdutycritical_4B63F007 will be destroyed
  # (because pagerduty_service.v3proxyapi_pagerduty_pagerdutycritical_4B63F007 is not in configuration)
  - resource "pagerduty_service" "v3proxyapi_pagerduty_pagerdutycritical_4B63F007" {
      - acknowledgement_timeout = "600" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2023-08-11T12:02:20-07:00" -> null
      - description             = "PagerDuty Critical" -> null
      - escalation_policy       = "PQ2EUPZ" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PH9DYOF" -> null
      - id                      = "PH9DYOF" -> null
      - name                    = "V3ProxyApi-Prod-PagerDuty-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service.v3proxyapi_pagerduty_pagerdutynoncritical_9355E0E2 will be destroyed
  # (because pagerduty_service.v3proxyapi_pagerduty_pagerdutynoncritical_9355E0E2 is not in configuration)
  - resource "pagerduty_service" "v3proxyapi_pagerduty_pagerdutynoncritical_9355E0E2" {
      - acknowledgement_timeout = "600" -> null
      - alert_creation          = "create_incidents" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "14400" -> null
      - created_at              = "2023-08-11T12:02:20-07:00" -> null
      - description             = "PagerDuty Non-Critical" -> null
      - escalation_policy       = "PXOQVEP" -> null
      - html_url                = "https://mozilla.pagerduty.com/service-directory/PKJ1Z15" -> null
      - id                      = "PKJ1Z15" -> null
      - name                    = "V3ProxyApi-Prod-PagerDuty-Non-Critical" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "low" -> null
        }
    }

  # pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181critical_F7F4BF9E will be destroyed
  # (because pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181critical_F7F4BF9E is not in configuration)
  - resource "pagerduty_service_integration" "v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181critical_F7F4BF9E" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH9DYOF/integrations/PBFTQ5W" -> null
      - id              = "PBFTQ5W" -> null
      - integration_key = "2c982c1f578c4a0dc0ae90d7694e6d24" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PH9DYOF" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181noncritical_2EA18A56 will be destroyed
  # (because pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181noncritical_2EA18A56 is not in configuration)
  - resource "pagerduty_service_integration" "v3proxyapi_pagerduty_v3proxyapipagerdutycloudwatchD89C9181noncritical_2EA18A56" {
      - html_url        = "https://mozilla.pagerduty.com/services/PKJ1Z15/integrations/P04GRN2" -> null
      - id              = "P04GRN2" -> null
      - integration_key = "b49ecaf57bdd4803d0acfa361d6cb7b8" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PKJ1Z15" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dcritical_EBABC12B will be destroyed
  # (because pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dcritical_EBABC12B is not in configuration)
  - resource "pagerduty_service_integration" "v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dcritical_EBABC12B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PH9DYOF/integrations/PFREQHJ" -> null
      - id              = "PFREQHJ" -> null
      - integration_key = "f3f4d72647b24c0bc067af3233874b3b" -> null
      - name            = "Sentry" -> null
      - service         = "PH9DYOF" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dnoncritical_D78AAE24 will be destroyed
  # (because pagerduty_service_integration.v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dnoncritical_D78AAE24 is not in configuration)
  - resource "pagerduty_service_integration" "v3proxyapi_pagerduty_v3proxyapipagerdutysentry985EF82Dnoncritical_D78AAE24" {
      - html_url        = "https://mozilla.pagerduty.com/services/PKJ1Z15/integrations/PJ12RX9" -> null
      - id              = "PJ12RX9" -> null
      - integration_key = "588c068ece5e4809c097b598b2f5a40a" -> null
      - name            = "Sentry" -> null
      - service         = "PKJ1Z15" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 5 to add, 9 to change, 22 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"67f7c037-9167-47a3-8b29-351ec5c40035","JobName":"v3-proxy-api_infrastructure_plan_prod","PRNumber":160,"Program":"tfcmt","SHA1":"7c44cb0e63151d89dd9e9dd7c2bef229f76a1930","Target":"v3-proxy-api-cdk","Vars":{}} -->